Repository: AzSumToshko/AutoPointWeb
Catalog: AutoPoint/Resources/Views/Home/EngineSpecifications.*.resx
Languages: bg

source: Cam type:
bg: Тип камера:

source: Cylindes:
bg: Цилиндри:

source: Do you want to
bg: Искате ли да

source: Drive type:
bg: Тип задвижване

source: Engine / Trim ID:
bg: Двигател / Рама ID

source: Engine specifications
bg: Спецификации на двигателя

source: Engine type:
bg: Тип двигател

source: Fuel type:
bg: Вид гориво

source: Get specs about specific cars engine
bg: Вземете спецификации за конкретен автомобилен двигател

source: Home
bg: Начало

source: Horsepower(HP):
bg: Конски сили(НР)

source: Horsepower(RPM):
bg: Конски сили (RPM)

source: make
bg: марка

source: model
bg: модел

source: Search
bg: Търсене

source: This function handles only engines made in 2020 year of the listed makes
bg: Тази функция поддържа само двигатели направени 2020 година от изброените марки

source: Torque(LBS):
bg: Въртящ момент(LBS)

source: Torque(RPM):
bg: Въртящ момент(RPM)

source: Transmission:
bg: Предаване

source: try again
bg: опитате отново

source: Valve timing:
bg: Синхронизация на клапаните

source: Valves:
bg: Клапани
